# More Data Preprocessing (with Pandas)

Pandas is a very useful data analytics package within Python.

Let's start with some random data.

In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f', 'h'], columns=['one', 'two', 'three'])
df

        one       two     three
a  0.338928 -1.786348  0.754625
c  0.236499  1.028497 -1.837977
e -0.848082  0.511090 -1.722330
f -0.144104 -1.468558 -0.318691
h  0.272672  0.487842 -0.075973

We know with Pandas we can mix & match data types, so let us add two more columns, named 'four' and 'five':

In [4]:
df['four'] = 'bar'
df['five'] = df['one'] > 0
df

        one       two     three four   five
a  0.338928 -1.786348  0.754625  bar   True
c  0.236499  1.028497 -1.837977  bar   True
e -0.848082  0.511090 -1.722330  bar  False
f -0.144104 -1.468558 -0.318691  bar  False
h  0.272672  0.487842 -0.075973  bar   True

Adding new rows is also simple. Below we include three extra empty rows:

In [5]:
df2 = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
df2

        one       two     three four   five
a  0.338928 -1.786348  0.754625  bar   True
b       NaN       NaN       NaN  NaN    NaN
c  0.236499  1.028497 -1.837977  bar   True
d       NaN       NaN       NaN  NaN    NaN
e -0.848082  0.511090 -1.722330  bar  False
f -0.144104 -1.468558 -0.318691  bar  False
g       NaN       NaN       NaN  NaN    NaN
h  0.272672  0.487842 -0.075973  bar   True

# Your Turn Here

Do you still remember how to index a row/column?

In [6]:
#### index row 'c' below

df.loc['c']

one      0.236499
two        1.0285
three    -1.83798
four          bar
five         True
Name: c, dtype: object

In [9]:
#### index column 'two' below

df.loc[:,'two']

a   -1.786348
c    1.028497
e    0.511090
f   -1.468558
h    0.487842
Name: two, dtype: float64

pandas has two functions isnull() and notnull() that return boolean objects when called.

In [12]:
pd.isnull(df2['one'])

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: one, dtype: bool

In [13]:
pd.notnull(df2['one'])

a     True
b    False
c     True
d    False
e     True
f     True
g    False
h     True
Name: one, dtype: bool

Missing values propagate naturally through arithmetic operations between pandas objects.

In [16]:
a = df[['one','two']]
a['one']['a':'e'] = float('nan')
a

        one       two
a       NaN -1.786348
c       NaN  1.028497
e       NaN  0.511090
f -0.144104 -1.468558
h  0.272672  0.487842

In [18]:
b = df[['one','two','three']]
b

        one       two     three
a  0.338928 -1.786348  0.754625
c  0.236499  1.028497 -1.837977
e -0.848082  0.511090 -1.722330
f -0.144104 -1.468558 -0.318691
h  0.272672  0.487842 -0.075973

In [19]:
a + b

        one  three       two
a       NaN    NaN -3.572696
c       NaN    NaN  2.056993
e       NaN    NaN  1.022180
f -0.288208    NaN -2.937116
h  0.545344    NaN  0.975685

# How to deal with Missing Values

## Deleting Missing Values

The simplest method is always dropping all missing values - but it is highly **discouraged!!!**

In [20]:
a['one'].dropna()

f   -0.144104
h    0.272672
Name: one, dtype: float64

By default, dropna() will drop any row containing **NaN** values, but you can change that by using the *axis=* and *thresh=* arguments.

**NOTE**: Dropping rows or columns have different uses.

In [21]:
#### This statement drop any column with NaN values
a.dropna(axis=1)

        two
a -1.786348
c  1.028497
e  0.511090
f -1.468558
h  0.487842

In [23]:
#### thresh determines how many non-NaN values a column/row should have without being dropped
c = a + b
c.dropna(axis=1, thresh=2)

        one       two
a       NaN -3.572696
c       NaN  2.056993
e       NaN  1.022180
f -0.288208 -2.937116
h  0.545344  0.975685

You can also use the *how=* argument to determine how do you want to remove the NaN values.

In [25]:
#### By default, dropna() drops column/row with any NaN values
#### how = 'all' changes that to dropping column/row with all NaN values
c.dropna(axis=1, how='all')

# how 'all' meaning it will only drop columns with all values missing

        one       two
a       NaN -3.572696
c       NaN  2.056993
e       NaN  1.022180
f -0.288208 -2.937116
h  0.545344  0.975685

You can refer to the [pandas.dropna() docs](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.dropna.html) for more information.

## Imputing Missing Values

Imputing means filling missing values - you can do that when the missing and non-missing values are in some type of relationship.

In [26]:
my_series = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
my_series

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [27]:
#### you can fill missing values with a specific value (0)
my_series.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

Alternatively, we can specify a forward-fill to propagate the previous value forward:

In [29]:
# forward-fill
my_series.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

Or we can specify a back-fill to propagate the next values backward:

In [30]:
my_series.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

## Your Turn Here
Aforementioned method can be applied to dataframes.

In [43]:
#### Let us generate a random dataframe
rand_df = pd.DataFrame(np.random.randn(5, 3), 
                  index=['a', 'b', 'c', 'd', 'e'],
                  columns=['one', 'two', 'three'])
rand_df = rand_df.mask(np.random.random(rand_df.shape) < .3)
rand_df

        one       two     three
a  0.182480 -0.429342 -2.014349
b  0.544721 -2.038777  1.312572
c       NaN  0.120008  0.888153
d -1.446951 -0.792437       NaN
e  0.315587 -0.033469  0.735060

Your tasks are as follows:

- fill missing values in column **one** with value 1;
- fill missing values in column **two** with forward-filling;
- fill missing values in column **three** with backward-filling.

In [44]:
#### insert your code here

rand_df['one'] = rand_df['one'].fillna(1)
rand_df['two'] = rand_df['two'].fillna(method='ffill')
rand_df['three'] = rand_df['three'].fillna(method='bfill')
rand_df

        one       two     three
a  0.182480 -0.429342 -2.014349
b  0.544721 -2.038777  1.312572
c  1.000000  0.120008  0.888153
d -1.446951 -0.792437  0.735060
e  0.315587 -0.033469  0.735060

A useful approach for imputing your missing data is to use mean/mode to replace missing data - the reason behind this logic is that if we are going to *guess* the values of the missing data, the highest chance would be guessing it to be the mean/mode if the data follows **normal** distribution.

In [45]:
#### let us generate another DF
my_df = pd.DataFrame(np.random.randn(5, 3), 
                  index=['a', 'b', 'c', 'd', 'e'],
                  columns=['A', 'B', 'C'])
my_df = my_df.mask(np.random.random(my_df.shape) < .3)
my_df

          A         B         C
a -0.600326  0.099562       NaN
b -0.047895 -0.430918  1.397455
c  2.280973       NaN -1.151165
d  0.874032       NaN -0.027423
e  0.468548  0.789653  0.450050

In [46]:
#### Let us check if there is any missing value in the df
my_df.isnull().values.any()

True

In [47]:
#### Then we are getting the mean of the DF
#### Note that since we only 
my_df.mean()

A    0.595067
B    0.152766
C    0.167229
dtype: float64

In [48]:
df_filled = my_df.fillna(my_df.mean())
df_filled

          A         B         C
a -0.600326  0.099562  0.167229
b -0.047895 -0.430918  1.397455
c  2.280973  0.152766 -1.151165
d  0.874032  0.152766 -0.027423
e  0.468548  0.789653  0.450050

In [49]:
#### Now let us check again if there is any missing values
df_filled.isnull().values.any()

False

More info regarding how to handle missing data can be found [here](https://machinelearningmastery.com/handle-missing-data-python/).

# Other Tasks in Data Preprocessing

- Handling categorical data (coding)
- Handling imbalanced data
- feature engineering

These topics will be covered in later part of this class.